economy_manager/app/controllers/ai_tables_controller.rb

SELECT "ai_tables".* FROM "ai_tables"
---
  def index
    @ai_table = AiTable.all

INSERT INTO "ai_tables" ("acronym", "name", "imgUrl", "gross", "trade", "co", "iso", "ant", "state", "ind", "last_modified") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["acronym", "55"], ["name", "5"], ["imgUrl", "5"], ["gross", 5], ["trade", 5], ["co", 55], ["iso", 5], ["ant", 5], ["state", 5], ["ind", 5], ["last_modified", nil]]
---
  def create
    @ai_table = AiTable.new(ai_table_params)

    respond_to do |format|
      if @ai_table.save

UPDATE "ai_tables" SET "gross" = ? WHERE "ai_tables"."id" = ?  [["gross", 25], ["id", 1]]
---
  def update
    respond_to do |format|
      if @ai_table.update(ai_table_params)

DELETE FROM "ai_tables" WHERE "ai_tables"."id" = ?  [["id", 1]]
---
  def destroy
    @ai_table.destroy!

SELECT "ai_tables".* FROM "ai_tables" WHERE "ai_tables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_ai_table
      @ai_table = AiTable.find(params[:id])