economy_manager/app/controllers/tables_controller.rb

SELECT "ai_tables".* FROM "ai_tables"
SELECT "econ_tables".* FROM "econ_tables"
---
  def index
    @econ_tables = EconTable.all