eco_backen/app/controllers/econ_tables_controller.rb

  def index
    @econ_tables = EconTable.all
---
SELECT "econ_tables".* FROM "econ_tables"

  def create
    @econ_table = EconTable.new(econ_table_params)

    respond_to do |format|
      if @econ_table.save
---
INSERT INTO "econ_tables" ("acronym", "name", "imgUrl", "gross", "trade", "expenditure", "reserve", "status", "co", "iso", "ant", "state", "ind", "last_modified") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @econ_table.update(econ_table_params)
---
UPDATE "econ_tables" SET "trade" = ?, "expenditure" = ?, "reserve" = ?, "iso" = ?, "ant" = ?, "state" = ?, "ind" = ? WHERE "econ_tables"."id" = ?  [["trade", 60000000], ["expenditure", 0], ["reserve", 11000000], ["iso", 45], ["ant", 0], ["state", 20], ["ind", 80], ["id", 3]]

  def destroy
    @econ_table.destroy!
---
DELETE FROM "econ_tables" WHERE "econ_tables"."id" = ?  [["id", 2]]

    def set_econ_table
      @econ_table = EconTable.find(params[:id])
---
SELECT "econ_tables".* FROM "econ_tables" WHERE "econ_tables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]