eco_backen/app/controllers/tables_controller.rb

  def index
    @econ_tables = EconTable.all
---
SELECT "ai_tables".* FROM "ai_tables"
SELECT "econ_tables".* FROM "econ_tables"